pikasTech/PikaPython/bsp/stm32f407-Arm-2D/stm32f407-Arm-2D-block/Arm-2D/examples/watch_panel/RTE/Device/SSE-200-MPS3/startup_cmsdk_mps3_sse_200.s
;/*
; * Copyright (c) 2018 ARM Limited
; *
; * Licensed under the Apache License, Version 2.0 (the "License");
; * you may not use this file except in compliance with the License.
; * You may obtain a copy of the License at
; *
; *     http://www.apache.org/licenses/LICENSE-2.0
; *
; * Unless required by applicable law or agreed to in writing, software
; * distributed under the License is distributed on an "AS IS" BASIS,
; * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
; * See the License for the specific language governing permissions and
; * limitations under the License.
; */
;
; This file is derivative of CMSIS V5.00 startup_ARMv8MML.s

;/*
;//-------- <<< Use Configuration Wizard in Context Menu >>> ------------------
;*/


; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x00001000

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


Heap_Size       EQU     0x00001000

                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
__heap_base
Heap_Mem        SPACE   Heap_Size
__heap_limit

; Vector Table Mapped to Address 0 at Reset

                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size

__Vectors       DCD     __initial_sp              ; Top of Stack
                DCD     Reset_Handler             ; Reset Handler
                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     SecureFault_Handler       ; Secure Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; Core IoT Interrupts
                DCD      NONSEC_WATCHDOG_RESET_Handler  ; - 0 Non-Secure Watchdog Reset Handler
                DCD      NONSEC_WATCHDOG_Handler        ; - 1 Non-Secure Watchdog Handler
                DCD      S32K_TIMER_Handler             ; - 2 S32K Timer Handler
                DCD      TIMER0_Handler                 ; - 3 TIMER 0 Handler
                DCD      TIMER1_Handler                 ; - 4 TIMER 1 Handler
                DCD      DUALTIMER_Handler              ; - 5 Dual Timer Handler
                DCD      MHU0_Handler                   ; - 6 Message Handling Unit 0
                DCD      MHU1_Handler                   ; - 7 Message Handling Unit 1
                DCD      0                              ; Reserved - 8
                DCD      MPC_Handler                    ; - 9 MPC Combined (Secure) Handler
                DCD      PPC_Handler                    ; - 10 PPC Combined (Secure) Handler
                DCD      MSC_Handler                    ; - 11 MSC Combined (Secure) Handler
                DCD      BRIDGE_ERROR_Handler           ; - 12 Bridge Error Combined (Secure) Handler
                DCD      INVALID_INSTR_CACHE_Handler    ; - 13 CPU Instruction Cache Invalidation Handler
                DCD      0                              ; Reserved - 14
                DCD      SYS_PPU_Handler                ; - 15 SYS PPU Handler
                DCD      CPU0_PPU_Handler               ; - 16 CPU0 PPU Handler
                DCD      CPU1_PPU_Handler               ; - 17 CPU1 PPU Handler
                DCD      CPU0_DBG_PPU_Handler           ; - 18 CPU0 DBG PPU_Handler
                DCD      CPU1_DBG_PPU_Handler           ; - 19 CPU1 DBG PPU_Handler
                DCD      CRYPT_PPU_Handler              ; - 20 CRYPT PPU Handler
                DCD      CORDIO_PPU_Handler             ; - 21 CORDIO PPU Handler
                DCD      RAM0_PPU_Handler               ; - 22 RAM0 PPU Handler
                DCD      RAM1_PPU_Handler               ; - 23 RAM1 PPU Handler
                DCD      RAM2_PPU_Handler               ; - 24 RAM2 PPU Handler
                DCD      RAM3_PPU_Handler               ; - 25 RAM3 PPU Handler
                DCD      0                              ; Reserved - 26
                DCD      0                              ; Reserved - 27
                DCD      CPU0_CTI_Handler               ; - 28 CPU0 CTI Handler
                DCD      CPU1_CTI_Handler               ; - 29 CPU1 CTI Handler
                DCD      0                              ; Reserved - 30
                DCD      0                              ; Reserved - 31
                ; External Interrupts
                DCD     UARTRX0_Handler           ; 32 UART 0 RX Handler
                DCD     UARTTX0_Handler           ; 33 UART 0 TX Handler
                DCD     UARTRX1_Handler           ; 34 UART 1 RX Handler
                DCD     UARTTX1_Handler           ; 35 UART 1 TX Handler
                DCD     UARTRX2_Handler           ; 36 UART 2 RX Handler
                DCD     UARTTX2_Handler           ; 37 UART 2 TX Handler
                DCD     UARTRX3_Handler           ; 38 UART 3 RX Handler
                DCD     UARTTX3_Handler           ; 39 UART 3 TX Handler
                DCD     UARTRX4_Handler           ; 40 UART 4 RX Handler
                DCD     UARTTX4_Handler           ; 41 UART 4 TX Handler
                DCD     UART0_Handler             ; 42 UART 0 combined Handler
                DCD     UART1_Handler             ; 43 UART 1 combined Handler
                DCD     UART2_Handler             ; 44 UART 2 combined Handler
                DCD     UART3_Handler             ; 45 UART 3 combined Handler
                DCD     UART4_Handler             ; 46 UART 4 combined Handler
                DCD     UARTOVF_Handler           ; 47 UART 0,1,2,3,4 Overflow Handler
                DCD     ETHERNET_Handler          ; 48 Ethernet Handler
                DCD     I2S_Handler               ; 49 I2S Handler
                DCD     TSC_Handler               ; 50 Touch Screen Handler
                DCD     0                         ; 51 Reserved
                DCD     SPI0_Handler              ; 52 SPI 0 Handler
                DCD     SPI1_Handler              ; 53 SPI 1 Handler
                DCD     SPI2_Handler              ; 54 SPI 2 Handler
                DCD     0                         ; 55 Reserved
                DCD     0                         ; 56 Reserved
                DCD     0                         ; 57 Reserved
                DCD     0                         ; 58 Reserved
                DCD     0                         ; 59 Reserved
                DCD     0                         ; 60 Reserved
                DCD     0                         ; 61 Reserved
                DCD     0                         ; 62 Reserved
                DCD     0                         ; 63 Reserved
                DCD     0                         ; 64 Reserved
                DCD     0                         ; 65 Reserved
                DCD     0                         ; 66 Reserved
                DCD     0                         ; 67 Reserved
                DCD     GPIO0_Handler             ; 68 GPIO 0 Comboned Handler
                DCD     GPIO1_Handler             ; 69 GPIO 1 Comboned Handler
                DCD     GPIO2_Handler             ; 70 GPIO 2 Comboned Handler
                DCD     GPIO3_Handler             ; 71 GPIO 3 Comboned Handler
                DCD     GPIO0_0_Handler           ; 72,
                DCD     GPIO0_1_Handler           ; 73,
                DCD     GPIO0_2_Handler           ; 74,
                DCD     GPIO0_3_Handler           ; 75,
                DCD     GPIO0_4_Handler           ; 76,
                DCD     GPIO0_5_Handler           ; 77,
                DCD     GPIO0_6_Handler           ; 78,
                DCD     GPIO0_7_Handler           ; 79,
                DCD     GPIO0_8_Handler           ; 80,
                DCD     GPIO0_9_Handler           ; 81,
                DCD     GPIO0_10_Handler          ; 82,
                DCD     GPIO0_11_Handler          ; 83,
                DCD     GPIO0_12_Handler          ; 84,
                DCD     GPIO0_13_Handler          ; 85,
                DCD     GPIO0_14_Handler          ; 86,
                DCD     GPIO0_15_Handler          ; 87,
                DCD     GPIO1_0_Handler           ; 88,
                DCD     GPIO1_1_Handler           ; 89,
                DCD     GPIO1_2_Handler           ; 90,
                DCD     GPIO1_3_Handler           ; 91,
                DCD     GPIO1_4_Handler           ; 92,
                DCD     GPIO1_5_Handler           ; 93,
                DCD     GPIO1_6_Handler           ; 94,
                DCD     GPIO1_7_Handler           ; 95,
                DCD     GPIO1_8_Handler           ; 96,
                DCD     GPIO1_9_Handler           ; 97,
                DCD     GPIO1_10_Handler          ; 98,
                DCD     GPIO1_11_Handler          ; 99,
                DCD     GPIO1_12_Handler          ; 100,
                DCD     GPIO1_13_Handler          ; 101,
                DCD     GPIO1_14_Handler          ; 102,
                DCD     GPIO1_15_Handler          ; 103,
                DCD     GPIO2_0_Handler           ; 104,      /* All P2 I/O pins used as irq source    */
                DCD     GPIO2_1_Handler           ; 105,      /* There are 15 pins in total            */
                DCD     GPIO2_2_Handler           ; 106,
                DCD     GPIO2_3_Handler           ; 107,
                DCD     GPIO2_4_Handler           ; 108,
                DCD     GPIO2_5_Handler           ; 109,
                DCD     GPIO2_6_Handler           ; 110,
                DCD     GPIO2_7_Handler           ; 111,
                DCD     GPIO2_8_Handler           ; 112,
                DCD     GPIO2_9_Handler           ; 113,
                DCD     GPIO2_10_Handler          ; 114,
                DCD     GPIO2_11_Handler          ; 115,
                DCD     GPIO2_12_Handler          ; 116,
                DCD     GPIO2_13_Handler          ; 117,
                DCD     GPIO2_14_Handler          ; 118,
                DCD     GPIO2_15_Handler          ; 119,
                DCD     GPIO3_0_Handler           ; 120,      /* All P3 I/O pins used as irq source    */
                DCD     GPIO3_1_Handler           ; 121,      /* There are 4 pins in total            */
                DCD     GPIO3_2_Handler           ; 122,
                DCD     GPIO3_3_Handler           ; 123,
                DCD     UARTRX5_Handler           ; 124, UART 5 RX Handler
                DCD     UARTTX5_Handler           ; 125, UART 5 TX Handler
                DCD     UART5_Handler             ; 126, UART 5 combined Handler
                DCD     HDLCD_Handler             ; 127, HDCLCD interrupt
__Vectors_End

__Vectors_Size  EQU     __Vectors_End - __Vectors

                AREA    |.text|, CODE, READONLY


